$$.module.address.source.hotel =
  '@Beijing|北京市|110000|@Tianjin|天津市|120000|@Shanghai|上海市|310000|@Guangzhou|广州市|440100|@Shenzhen|深圳市|440300|@Zhuhai|珠海市|440400|@Foshan|佛山市|440600|@Dongguan|东莞市|441900|@Zhongshan|中山市|442000|@Huizhou|惠州市|441300|@Shijiazhuang|石家庄市|130100|@Taiyuan|太原市|140100|@Shenyang|沈阳市|210100|@Dalian|大连市|210200|@Wuxi|无锡市|320200|@Changzhou|常州市|320400|@Shuozhou|苏州市|320500|@Nantong|南通市|320600|@Taizhou|泰州市|321200|@Nanchang|南昌市|360100|@Hangzhou|杭州市|330100|@Ningbo|宁波市|330200|@Wenzhou|温州市|330300|@Jiaxing|嘉兴市|330400|@Huzhou|湖州市|330500|@Shaoxing|绍兴市|330600|@Taizhou|台州市|331000|@Yiwu|义乌市|330782|@Hefei|合肥市|340100|@Fuzhou|福州市|350100|@Xiamen|厦门市|350200|@Quanzhou|泉州市|350500|@Zhangzhou|漳州市|350600|@Jinan|济南市|370100|@Qingdao|青岛市|370200|@Dongying|东营市|370500|@Yantai|烟台市|370600|@Weifang|潍坊市|370700|@Rizhao|日照市|371100|@Linyi|临沂市|371300|@Zhengzhou|郑州市|410100|@Luoyang|洛阳市|410300|@Wuhan|武汉市|420100|@Xiangyang|襄阳市|420600|@Jingzhou|荆州市|421000|@Changsha|长沙市|430100|@Haikou|海口市|460100|@Chongqing|重庆市|500000|@Chengdu|成都市|510100|@Leshan|乐山市|511100|@Mianyang|绵阳市|510700|@Kunming|昆明市|530100|@Honghezizhizhou|红河自治州|532500|@Xian|西安市|610100|@Guiyang|贵阳市|520100'
$$.module.address.source.hotel_hotData = {
  热门:
    '@110000|北京市@120000|天津市@310000|上海市@440100|广州市@440300|深圳市@440400|珠海市@440600|佛山市@441900|东莞市@130100|石家庄市@210200|大连市@320100|南京市@360100|南昌市@330100|杭州市@340100|合肥市@350200|厦门市@370100|济南市@410100|郑州市@420100|武汉市@430100|长沙市@500000|重庆市@520100|贵阳市',
  ABC:
    '@510100|成都市@320400|常州市@430100|长沙市@500000|重庆市',
  DEF:
    '@441900|东莞市@210200|大连市@370500|东营市@440600|佛山市@350100|福州市',
  GHJ:
    '@440100|广州市@520100|贵阳市@340100|合肥市@532500|红河自治州@460100|海口市@441300|惠州市@330100|杭州市@330500|湖州市@330400|嘉兴市@370100|济南市@421000|荆州市',
  KLM:
    '@530100|昆明市@371300|临沂市@511100|乐山市@410300|洛阳市@510700|绵阳市',
  NPQ:
    '@330200|宁波市@360100|南昌市@360100|南京市@320100|南平@320600|南通市@370200|青岛市@350500|泉州市',
  RST:
    '@371100|日照市@330600|绍兴市@310000|上海市@130100|石家庄市@440300|深圳市@320500|苏州市@120000|天津市@210100|沈阳市@140100|太原市@321200|泰州市@331000|台州市',
  WXY:
    '@420100|武汉市@370700|潍坊市@320200|无锡市@330300|温州市@610100|西安市@350200|厦门市@420600|襄阳市@330782|义乌市@370600|烟台市',
  Z:
    '@440400|珠海市@442000|中山市@350600|漳州市@410100|郑州市'
}

String.prototype.cntStr = function() {
  return this.replace(/@+/g, '@')
}
